<template>
  <view class="policy">
   正力新能访客预约小程序非常重视用户隐私政策并严格遵守相关的法律规定。请您仔细阅读《隐私政策》后再继续使用。如果您继续使用我们的服务，表示您已经充分阅读和理解我们协议的全部内容。<view/>
本小程序尊重并保护所有使用服务用户的个人隐私权。为了给您提供更准确、更优质的服务，本小程序会按照本隐私权政策的规定使用和披露您的个人信息。除本隐私权政策另有规定外，在未征得您事先许可的情况下，本小程序不会将这些信息对外披露或向第三方提供。本小程序会不时更新本隐私权政策。您在同意本小程序用户服务使用协议之时，即视为您已经同意本隐私权政策全部内容。<view/>
1. 适用范围<view/>
(a) 在您注册本小程序帐号时，您根据小程序要求提供的个人注册信息；<view/>
(b) 在您使用本小程序时上传的信息包括但不限于手机号、姓名、工作单位、身份、车牌号、本人照片等数据；<view/>
(c)本小程序通过合法途径从商业伙伴处取得的用户个人数据。<view/>
(d)本小程序严禁用户上传不良信息，如裸露、色情和亵渎内容，发布的内容我们会进行审核，一经发现不良信息，会禁用该用户的所有权限，予以封号处理。<view/>
2. 信息使用<view/>
(a)本小程序不会向任何无关第三方提供、出售、出租、分享或交易您的个人登录信息。<view/>
(b) 本小程序亦不允许任何第三方以任何手段收集、编辑、出售或者无偿传播您的个人信息。任何本小程序平台用户如从事上述活动，一经发现，本小程序有权立即终止与该用户的服务协议。<view/>
(c) 为服务用户的目的，本小程序可能通过使用您的个人信息，向您提供您感兴趣的信息，包括但不限于向您发出产品和服务信息。<view/>
3. 信息披露<view/>
在如下情况下，本小程序将依据您的个人意愿或法律的规定全部或部分的披露您的个人信息：<view/>
(a)未经您事先同意，我们不会向第三方披露；<view/>
(b)为提供您所要求的产品和服务，而必须和第三方分享您的个人信息；<view/>
(c)根据法律的有关规定，或者行政或司法机构的要求，向第三方或者行政、司法机构披露；<view/>
(d)如您出现违反中国有关法律、法规或者本小程序服务协议或相关规则的情况，需要向第三方披露；<view/>
(e)如您是适格的知识产权投诉人并已提起投诉，应被投诉人要求，向被投诉人披露，以便双方处理可能的权利纠纷；<view/>
4. 信息存储和交换<view/>
本小程序收集的有关您的信息和资料将保存在本小程序及（或）其关联公司的服务器上，这些信息和资料可能传送至您所在国家、地区或本小程序收集信息和资料所在地的境外并在境外被访问、存储和展示。<view/>
5. Cookie的使用<view/>
(a) 在您未拒绝接受cookies的情况下，本小程序会在您的计算机上设定或取用cookies,以便您能登录或使用依赖于cookies的本小程序平台服务或功能。本小程序使用cookies可为您提供更加周到的个性化服务，包括推广服务。<view/>
(b) 您有权选择接受或拒绝接受cookies。您可以通过修改浏览器设置的方式拒绝接受cookies。但如果您选择拒绝接受cookies，则您可能无法登录或使用依赖于cookies的本小程序网络服务或功能。<view/>
(c) 通过本小程序所设cookies所取得的有关信息，将适用本政策。<view/>
6.本隐私政策的更改<view/>
(a)如果决定更改隐私政策，我们会在本政策中、本公司网站中以及我们认为适当的位置发布这些更改，以便您了解我们如何收集、使用您的个人信息，哪些人可以访问这些信息，以及在什么情况下我们会透露这些信息。<view/>
(b)本公司保留随时修改本政策的权利，因此请经常查看。请您妥善保护自己的个人信息，仅在必要的情形下向他人提供。如您发现自己的个人信息泄密，尤其是本小程序用户名及密码发生泄露，请您立即联络本小程序相关人员，以便本小程序采取相应措施。<view/>
感谢您花时间了解我们的隐私政策！我们将尽全力保护您的个人信息和合法权益，再次感谢您的信任！
  </view>
</template>

<script setup>
</script>

<style lang="scss">
.policy {
  padding: 10px 16px;
  text-indent: 2em;
  font-size: 14px;
}
</style>
